// 1. Напишіть скрипт порівняння двох масивів. Виводь у консоль true якщо вони ідентичні, та false якщо ні ( довжина обох массивів однакова )
// ([1, 2, 3], [1, 2, 3]) => true
// const arr1 = [1,2,3,4];
// const arr2 = [1,2,3,5];


// --------------------

// 2. Написати скрипт який буде видаляти з масиву елемент та виводити масив після видалення в консоль.
// Якщо такого елемента в масиві немає – виводь у консоль помилку

// const arr = [1,2,3,4,5,6,7]
// const elementToRemove = 10;


//--------------------

// 3. Напишіть скрипт який буде виводити в консоль фрагмент масиву, що містить перші 'n' елементів масиву.
// const arr = [1,2,3,4,5,6,7] // length = 7
// const n = 8;

// Приклад
// n = 2 => [1,2]
// n = 4 => [1,2,3,4]


//--------------------

// 3. Напишіть скрипт, який створює масив елементів, що є сумою відповідних елементів заданих масивів.
// const arr1 = [1, 2, 3, 4, 5];
// const arr2 = [4, 5, 6];

// Результат має бути таким масивом – [5,7,9,4,5]

//--------------------

// 6. Реалізувати скрипт фільтру масиву за вказаним типом даних.

// Змінна arr - масив, який міститиме будь-які дані, filterType - тип даних.
// Потрібно створити новий масив, який міститиме всі дані, які були в arr, за винятком тих, тип яких був записаний у змінній filterType.
// Тобто якщо arr = ['hello', 'world', 23, '23', null], і filterType = 'string', то нови масив має бути таким [23, null].

// const arr = ['hello', 'world', 23, '23', null]
// const filterType = 'string'
