
// Task 1 
// Прочитайте кількість вкладених  li у список з класом outer, у список з класом inner та загальну клількість li на строінці


//-----------
// Task 2
// Написати функцію, яка буде приймати один аргумент – рядок з нікнеймом в instagram ) і генерувати інформаційний 
// блок для відкриття акаунту. Блок потрібно ставити в елемент з класом inst-info

/* <p>Visit instagram of <span class="bold">zelenskiy_official</span></p> */
// <a href="https://www.instagram.com/zelenskiy_official/">Open page</a> 


// Task 3
// Створити на основі масиву список з назвами міст. Додавати інлайн стиль кольору ( жовтий ) для міст, які
// не є столицею, а для столиці ставити blue. Cписок потрібно вставити у елемент з класом .cities


// Task 4
// Провалідувати img, які знаходяться у li, якщо немає src - за замовчуванням ставити https://proofthatblog.com/wp-content/uploads/2013/06/question-mark.jpg
// якщо немає alt – unknown
