// 1. Даний масив. Запишіть перший елемент цього масиву в змінну elem1, другий - в змінну elem2, третій - в змінну elem3,
// а всі інші елементи масиву - змінну arr

const newArr = [1,2,3,4,5,6,7];


// console.log(elem1);
// console.log(elem2);
// console.log(elem3);

//--------------------------


// 2. Даний об'єкт obj. Запишіть відповідні значення змінні name, surname за допомогою деструктуризації.
// Зробіть так, щоб, якщо якесь значення не задано - воно набирало наступного значення за замовчуванням:
// {name: 'Анонім', surname: 'Анонімович', age: '? років' Ї

const obj = {
    name: 'John',
    surname: 'Smith',
    age: 20,
}

//--------------------------

// 3. Перепишіть приклад використовуючи деструктуризацію

// const student = {
//     name: 'John Doe',
//     age: 16,
//     scores: {
//         maths: 10,
//         english: 11,
//         science: 9
//     }
// };
//
//
// function displaySummary(student) {
//
//     console.log(`Hello, ${student.name}`);
//     console.log(`Your Maths score is ${student.scores.maths || 0}`);
//     console.log(`Your English score is ${student.scores.english || 0}`);
//     console.log(`Your Science score is ${student.scores.science || 0}`);
// }

// displaySummary(student);
// Hello, John Doe
// Your Maths score is 74
// Your English score is 63
// Your Science score is 85

//--------------------------



// 4. Проведіть операції з деструктуризації масиву
// 1) Перемістіть значення масиву rgb в окремі змінні red, green, blue та виведіть їх у консоль ( R: red, G: green, B: blue )
// 2) Додайте дефолтне значення 255 для red та blue
// 3) Пропустіть перші два елементи та призначте лише третій елемент змінній blue


//--------------------------

// 5. Поміняйте значення двох змінних між собою за допомогою масивів та деструктуризації


//--------------------------

// 6.Напишіть функцію, яка створює змінні з ім'ям пірата ,
// а також – його статусом серед інших піратів та виводіть їх в консоль. Якщо статусу немає – він за замовчуванням "матрос"

const pirates = "Джон; Джек капітан; Енко кухар; Вася юнга; Інгрід";

// Приклад виводу у консоль:
// Джон - матрос
// Джек - капітан
// Енко - кухар
// Вася - юнга
// Інгрід - матрос

//--------------------------

// 7. Напишіть функцію, яка створює об'єкт.
// Як аргументи вона приймає в себе ім'я, прізвище, і перелік
// рядків формату "ім'яВластивості: значення". Їх може бути багато.
//
// Приклад роботи:
// const user = createObject("Іван", "Іванів", "wife: Анна", "car: Toyota",);
//  console.log(user);
/*
{
    name: "Іван",
    lastName: "Іванів",
    wife: "Анна",
    car: "Toyota",
    position: "director"
}
*/
// Використовуйте оператор rest та дестрктуризацію масиву


//--------------------------

// 8. У вас є 2 масиви - об'єднайте їх вміст (через функцію) в один totalCars максимально елегантним способом

// - другий елемент array2
// - елементи array1 без першого елемента
// - Перший елемент array1
// - елементи array2 без другого елемента

// ['другий елемент array2', 'елементи array1 без першого елемента', 'Перший елемент array1', 'елементи array2 без другого елемента']
// ["Bugatti", "Ford", "Alfa Romeo", "Audi", "BMW", "Cadillac", "Lexus", "Chevrolet", "Ferrari"]

const johnCars = ["Cadillac", "Ford", "Alfa Romeo", "Audi", "BMW", ];
const maryCars = ["Lexus", "Bugatti", "Chevrolet", "Ferrari",];

//--------------------------
