// 1. Реалізувати функцію, яка отримуватиме масив елементів і виводитиме їх на сторінку у вигляді списку.

// Створити функцію, яка прийматиме на вхід масив.
// Кожен із елементів масиву вивести на сторінку у вигляді пункту списку
// Необхідно використовувати шаблонні рядки та функцію map масиву для формування контенту списку перед виведенням його на сторінку.
// Якщо всередині масиву одним із елементів буде ще один масив або об'єкт, виводити його як вкладений список.


//--------------------------


// 2. Реалізувати функцію підсвічування клавіш.

// У файлі index.html лежить розмітка кнопок.
// Кожна кнопка містить назву клавіші на клавіатурі
// Після натискання вказаних клавіш - та кнопка, на якій написана ця літера, повинна фарбуватись у синій колір.
// При цьому якщо якась інша літера вже раніше була пофарбована в синій колір - вона стає чорною.
// Наприклад, за натисканням Enter перша кнопка забарвлюється в синій колір.
// Далі користувач натискає S, і кнопка S фарбується в синій колір, а кнопка Enter знову стає чорною.
