// Створити таблицю, при натисканні на комірки якої вони змінюватимуть колір.
//
// Технічні вимоги:
//
//  1) Створити поле 30*30 із білих клітинок з допомогою елемента <table>.
//  2) При натисканні на білу клітинку вона повинна змінювати колір на чорний. 
//          При натисканні на чорну клітинку вона повинна змінювати колір назад на білий.
//  3) Сама таблиця повинна бути не вставлена у вихідний HTML-код, а згенерована і додана в DOM сторінки за допомогою Javascript.
//  4) При натисканні на будь-яке місце документа поза таблицею, всі кольори клітин повинні змінитися на протилежні (підказка: необхідно поставити Event Listener на <body>).
//  5) Щоб змінити кольори всіх клітин одночасно, не потрібно обходити їх у циклі. Якщо помічати натиснуті клітини певним класом, то перефарбувати їх всі одночасно можна однією дією - змінивши клас на самій таблиці.
