// 1. Використовуючи конструкцію if..else і prompt, напиши код, який запитуватиме:
// "Яка офіційна назва JavaScript?".
// Якщо користувач вводить ECMAScript, то показуй alert з рядком "Вірно!",
// інакше - "Не знаєте? ECMAScript!"
// const message = prompt("Яка офіційна назва JavaScript?")
// if (message.toLowerCase() === 'ECMAScript'.toLowerCase()) {
//     alert("Вірно!")
// } else {
//     alert("Не знаєте? ECMAScript!")
// }


//----------------------

// 2. Напиши скрипт для відображення годин та хвилин у консолі браузера
// у вигляді рядка формату "14 год. 26 хв.".
// Якщо значення змінної хвилин дорівнює 0, то виводь рядок "14 год.", без хвилин.

// const hours = 14;
// const minutes = 0;
// // console.log(`${hours} год. ${minutes} хв.`);
// let time = `${hours} год.`
// if (minutes > 0) {
// 	time += `${minutes} хв.`;

// }
// console.log(time);



//----------------------

// 3. Напиши скрипт, який виводить у консоль рядок "Це позитивне число", якщо в prompt користувач
// ввів число більше нуля.
// Якщо було введено нуль, виводь у консоль рядок "Це нуль". Якщо передали від'ємне число,
// у консолі має бути рядок "Це від'ємне число".

// const number = Number(prompt('Введіть число!'));

// if (number === 0) {
//     console.log("Це нуль")
// } else if (number > 0) {
//     console.log("Це позитивне число")
// } else {
//     console.log("Це від'ємне число");
// }


//----------------------

// 4. Напиши скрипт, який порівнює числа змінних a і b. Якщо обидва значення більше 100,
// виведи в консоль максимальне з них.
// Інакше у консолі має бути сума значення b та числа 512.
const a = 104;
const b = 88;

// if (a > 100 && b > 100 ) {
//     console.log(Math.max(a, b))
// } else {
//     console.log (b + 512)
// }


// ----------------------

// 5. Напиши скрипт який перевіряє чи закінчується значення змінної link символом /.
// Якщо ні, додай до кінця значення link цей символ. Використовуй конструкцію if...else.

// let link = 'https://somesite.com/about';
// if(link.endsWith('/')){
//     console.log(link)
// }else{
//     link+= '/';
//     console.log(link)
// }



//----------------------

// 6. Напиши скрипт який перевіряє чи закінчується значення змінної link символом /.
// Якщо ні, додай у кінець значення link цей символ, але тільки в тому випадку, якщо в link є підрядок "my-site".
// Використовуй конструкцію if

// let link = 'https://my-site.com/about';
// if(!link.endsWith('/') && link.includes("my-site") ){
//     link+= '/';
//
// }
// console.log(link)


// let link = 'https://somesite.com/about';



//----------------------

// 7. Виконай рефакторинг коду задачі номер 6, використовуючи тернарний оператор.

// let link = 'https://my-site/somesite.com/about';
// link += !link.endsWith('/') && link.includes("my-site") ? '/': ''

//----------------------

// 8. Напиши скрипт який виводитиме в консоль браузера рядок залежно від значення змінної hours.

// Якщо значення змінної hours:
// менше 17, виводь рядок "Pending"
// більше або дорівнює 17 і менше або дорівнює 24, виводь рядок "Expires"
// більше 24 , виводь рядок "Overdue"
//  const hours= 46;
//  if(hours<17){
//     console.log("Pending")
//  }else if(hours>=17 && hours<=24){
//     console.log("Expires")
//  }else{
//     console.log("Overdue")
//  }



//----------------------

// 9. Напиши скрипт для відображення часу дедлайн здачі проекту. Використовуй конструкцію if...else.

// Якщо до дедлайну 0 днів - виведи рядок "Сьогодні"
// Якщо до дедлайну 1 день - виведи рядок "Завтра"
// Якщо до дедлайну 2 дні - виведи рядок "Післязавтра"
// Якщо до дедлайну 3+ днів - виведи рядок "Дата в майбутньому"
// const deadline = 5;
// if (deadline === 0) {
//     console.log("Сьогодні")
// } else if (deadline === 1) {
//     console.log("Завтра")
// }else if (deadline === 2) {
//     console.log("Післязавтра")
// } else  {
//     console.log("Дата в майбутньому")
// }


//----------------------

// 10. Виконай рефакторинг коду задачі номер 5, використовуючи switch.
// const deadline = 70;

// switch(deadline) {
//    case 0:
//    console.log ("Сьогодні");
//     break;

//     case 1:
//    console.log("Завтра");
//     break;

//     case 2:
//    console.log("Післязавтра");
//     break;

//     default:
//     console.log("Дата в майбутньому");
// }

//----------------------

// 11. Напиши цикл for який виводить у консоль браузера числа за зростанням від min до max, але якщо число кратне 5.
// const min = 1;
// const max = 100;

// for (let i = min; i <= max; i+=1) {
//     if (i%5===0){
//         console.log(i);
//     }
// }


//----------------------

// 12. Напиши скрипт, який запитуватиме логін за допомогою prompt і логуватиме
// результат у консоль браузера.

// Якщо відвідувач вводить "адмін", то prompt запитує пароль
// Якщо нічого не введено або натиснуто клавішу Esc - вивести рядок "Скасовано"
// В іншому випадку вивести рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "12345", то вивести рядок "Вітаю!"
// Інакше виводити рядок "Невірний пароль"

// const login = prompt("Input login");

// if (login === "адмін") {
//     const password = prompt("Input password");
//     if(password === "12345" ) {
//         console.log("Вітаю!");
//     }
//     else {
//         console.log("Невірний пароль");
//     }

// }

// else if (login === null) {
//      console.log("Скасовано");
// }
// else {
//     console.log("Я вас не знаю");
// }


//----------------------

// 13. Запитати у юзера число, і побудувати прямокутний трикутник в консолі

// 1 - * // wrong !

// 2 - *
//     **

// 4 - *
//     **
//     ***
//     ****

// const message = prompt("Введіть число більше ніж 1");
// if (message <= 1) {
//     alert("Неправильне число");
// } else {
//     for (let i = 1; i <= message; i += 1) {
//         console.log("*".repeat(i));
//     }
// }
