// 1. Використовуючи конструкцію if..else і prompt, напиши код, який запитуватиме: "Яка офіційна назва JavaScript?".
// Якщо користувач вводить ECMAScript, то показуй alert з рядком "Вірно!", інакше - "Не знаєте? ECMAScript!"


//----------------------

// 2. Напиши скрипт для відображення годин та хвилин у консолі браузера у вигляді рядка формату "14 год. 26 хв.".
// Якщо значення змінної хвилин дорівнює 0, то виводь рядок "14 год.", без хвилин.

// const hours = 14;
// const minutes = 23;


//----------------------

// 3. Напиши скрипт, який виводить у консоль рядок "Це позитивне число", якщо в prompt користувач ввів число більше нуля.
// Якщо було введено нуль, виводь у консоль рядок "Це нуль". Якщо передали від'ємне число, у консолі має бути рядок "Це від'ємне число".


//----------------------

// 4. Напиши скрипт, який порівнює числа змінних a і b. Якщо обидва значення більше 100, виведи в консоль максимальне з них.
// Інакше у консолі має бути сума значення b та числа 512.


// ----------------------

// 5. Напиши скрипт який перевіряє чи закінчується значення змінної link символом /.
// Якщо ні, додай до кінця значення link цей символ. Використовуй конструкцію if...else.





//----------------------

// 6. Напиши скрипт який перевіряє чи закінчується значення змінної link символом /.
// Якщо ні, додай у кінець значення link цей символ, але тільки в тому випадку, якщо в link є підрядок "my-site".
// Використовуй конструкцію if



// let link = 'https://somesite.com/about';



//----------------------

// 7. Виконай рефакторинг коду задачі номер 6, використовуючи тернарний оператор.

// let link = 'https://my-site/somesite.com/about';

//----------------------

// 8. Напиши скрипт який виводитиме в консоль браузера рядок залежно від значення змінної hours.

// Якщо значення змінної hours:
// менше 17, виводь рядок "Pending"
// більше або дорівнює 17 і менше або дорівнює 24, виводь рядок "Expires"
// більше 24 , виводь рядок "Overdue"
// const hours = Number(prompt('Введи число'));


//----------------------

// 9. Напиши скрипт для відображення часу дедлайн здачі проекту. Використовуй конструкцію if...else.

// Якщо до дедлайну 0 днів - виведи рядок "Сьогодні"
// Якщо до дедлайну 1 день - виведи рядок "Завтра"
// Якщо до дедлайну 2 дні - виведи рядок "Післязавтра"
// Якщо до дедлайну 3+ днів - виведи рядок "Дата в майбутньому"



//----------------------

// 10. Виконай рефакторинг коду задачі номер 5, використовуючи switch.


//----------------------

// 11. Напиши цикл for який виводить у консоль браузера числа за зростанням від min до max, але якщо число кратне 5.



//----------------------

// 12. Напиши скрипт, який запитуватиме логін за допомогою prompt і логуватиме результат у консоль браузера.

// Якщо відвідувач вводить "адмін", то prompt запитує пароль
// Якщо нічого не введено або натиснуто клавішу Esc - вивести рядок "Скасовано"
// В іншому випадку вивести рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "12345", то вивести рядок "Вітаю!"
// Інакше виводити рядок "Невірний пароль"




//----------------------

// 13. Запитати у юзера число, і побудувати прямокутний трикутник в консолі

// 1 - * // wrong !

// 2 - *
//     **

// 4 - *
//     **
//     ***
//     ****

