// 1. Використовуючи JavaScript, зробіть так, щоб при натисканні на кнопку зникав елемент з текстом



// -----------------

// 2. Створіть кнопку, при натисканні на неї вона приховуватиме сама себе.

// -----------------

// 3. У змінній button знаходиться кнопка.
// Спочатку обробників на ній немає.
// Що буде виведено під час кліку після виконання коду?


// button.addEventListener("click",  function() { alert("1"); });

// button.removeEventListener("click",  function() { alert("1"); });

// button.onclick =  function() { alert(2); }

// -----------------


// 4. Напишіть функцію removeChildren, яка видаляє всіх нащадків елемента.



// -----------------

// 5. Напишіть інтерфейс, щоб створити список.
//
// Для кожного пункту:
//
// Запитуйте вміст у користувача за допомогою prompt. Створюйте пункт ( li ) і додайте його до UL.
// Процес припиняється, коли користувач натискає ESC.
// Усі елементи мають створюватися динамічно.
//
// P.S. prompt повертає null, якщо користувач натиснув на ESC.
