// 1. Виведи на екран загальну кількість яблук та винограду. Різницю яблук та винограду.
const apples = 47;
const grapes = 135;


//-----------------------------------

// 2. Заміни вираз перевизначення комбінованим оператором +=,  -=, *=, /=.
// let students = 100;
// students = students + 50;
// console.log(students);




//-----------------------------------


// 3.Розбери пріоритет операторів в інструкції надання значення змінної result.
// const result = 101 + 300 / 10 - 60 + 10 * 4
// console.log(result);

//-----------------------------------

// 4. Склади фразу за допомогою шаблонних рядків A has B bots in stock, де A, B - змінні вставлені в рядок.
// const companyName = 'Cyberdyne Systems';
// const repairBots = 150;
// const defenceBots = 50;
// console.log(message);


// console.log(message);

//-----------------------------------

// 5. Напиши скрипт, який розраховує індекс маси тіла людини. Для цього необхідно розділити вагу в кілограмах на квадрат висоти людини за метри.
// let weight = '88.3';
// let height = '1.75';

// const bmi =
// console.log(bmi); // 28.8



//-----------------------------------

// 6. Напиши скрипт, який виводить у консоль заокруглені вгору/вниз і т.д. Значення змінної value.
// Використовуй методи Math.floor(), Math.ceil() та Math.round(). Перевірте, що буде в консолі при значеннях 27.3 і 27.9.


//-----------------------------------

// console.log(true && 3);

// console.log(false && 3);

// console.log(true && 4 && 'kiwi');

// console.log(true && 0 && 'kiwi');

// console.log(true || 3);

// console.log(true || 3 || 4);

// console.log(true || false || 7);

// console.log(null || 2 || undefined);

// console.log((1 && null && 2) > 0);

// console.log(null || (2 && 3) || 4);


// -----------------------------------

// 7.Напиши скрипт, який переведе значення totalMinutes (кількість хвилин) у рядок у форматі годин і хвилин HH:MM.

// 70 покаже 01:10
// 450 покаже 07:30
// 1441 покаже 24:01

// const totalMinutes = 70;



/* ЗАВДАННЯ 8
     * Записати в змінну '123', вивести в консоль typeof цієї змінної.
     * Перетворити цю змінну на чисельний тип за допомогою parseInt(), parseFloat(), унарний плюс +
     * Після цього повторно вивести в консоль typeof цієї змінної.
    * */

//  let myVar = "123.67";
//  console.log();
// //
//  let myVar2 =
// console.log();
// //
// let myVar3 =
// console.log(;

// let myVar4 =
// console.log();


// console.log();

//-----------------------------------

/* ЗАВДАННЯ 9
 * Вивести на екран модальне вікно prompt з повідомленням "Enter the number".
 * Результат виконання модального вікна записати в змінну, значення якої вивести в консоль.
 * */


//-----------------------------------

/* ЗАВДАННЯ 10
   * За допомогою модального вікна prompt отримати від користувача два числа.
   * Вивести в консоль суму, різницю, добуток, поділ та залишок від поділу їх один на одного.
   * */

//  console.log(0.1 + 0.2)

